/* No comment provided by engineer. */
"%d/%ld bytes" = "%1$d/%2$ld bytes";

/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Cannot connect with the device: %@" = "Cannot connect with the device: %@";

/* No comment provided by engineer. */
"Clean board licenses" = "Clean board licenses";

/* No comment provided by engineer. */
"Clean caches licenses" = "Clean caches licenses";

/* No comment provided by engineer. */
"Clean Licenses" = "Clean Licenses";

/* No comment provided by engineer. */
"Clear" = "Clear";

/* No comment provided by engineer. */
"Connecting" = "Connecting";

/* No comment provided by engineer. */
"Error" = "Error";

/* No comment provided by engineer. */
"Error cleaning the board licenses" = "Error cleaning the board licenses";

/* No comment provided by engineer. */
"Error sending the data" = "Error sending the data";

/* No comment provided by engineer. */
"Error while opening the file" = "Error while opening the file";

/* No comment provided by engineer. */
"Firmware Upgrade" = "Firmware Upgrade";

/* No comment provided by engineer. */
"Firmware upgrade not available" = "Firmware upgrade not available";

/* No comment provided by engineer. */
"Firmware upgrade not supported, please upgrade the firmware" = "Firmware upgrade not supported, please upgrade the firmware";

/* No comment provided by engineer. */
"Flashing the new firmware" = "Flashing the new firmware";

/* No comment provided by engineer. */
"Formatting..." = "Formatting...";

/* No comment provided by engineer. */
"FW Flash done" = "FW Flash done";

/* No comment provided by engineer. */
"Hide keyboard" = "Hide keyboard";

/* No comment provided by engineer. */
"Invalid company" = "Invalid company";

/* No comment provided by engineer. */
"Invalid E-Mail" = "Invalid E-Mail";

/* No comment provided by engineer. */
"Invalid license code" = "Invalid license code";

/* No comment provided by engineer. */
"Invalid license name" = "Invalid license name";

/* No comment provided by engineer. */
"Invalid name" = "Invalid name";

/* No comment provided by engineer. */
"License loaded, reconnect to the board to enable it" = "License loaded, reconnect to the board to enable it";

/* No comment provided by engineer. */
"License Manager" = "License Manager";

/* No comment provided by engineer. */
"License manager not supported" = "License manager not supported";

/* No comment provided by engineer. */
"Licenses removed, board is resetting" = "Licenses removed, board is resetting";

/* No comment provided by engineer. */
"Loading license status" = "Loading license status";

/* No comment provided by engineer. */
"Logger data" = "Logger data";

/* No comment provided by engineer. */
"Message Failed!" = "Message Failed!";

/* No comment provided by engineer. */
"Message Ok" = "Message Ok";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Please use only Latin chars" = "Please use only Latin chars";

/* No comment provided by engineer. */
"Reading firmware version" = "Reading firmware version";

/* No comment provided by engineer. */
"Send ?? for help" = "Send ?? for help";

/* No comment provided by engineer. */
"Send help" = "Send help";

/* No comment provided by engineer. */
"Show Debug Console" = "Show Debug Console";

/* No comment provided by engineer. */
"Start Logging" = "Start Logging";

/* No comment provided by engineer. */
"Stop Logging" = "Stop Logging";

/* No comment provided by engineer. */
"Transmitted data are corrupted" = "Transmitted data are corrupted";

/* No comment provided by engineer. */
"Unknown Error" = "Unknown Error";

/* No comment provided by engineer. */
"Upgrade completed in: %.2fs\nThe board is resetting" = "Upgrade completed in: %.2fs\nThe board is resetting";

/* No comment provided by engineer. */
"Valid license" = "Valid license";

/* No comment provided by engineer. */
"Version: %@" = "Version: %@";

/* No comment provided by engineer. */
"Wrong license name" = "Wrong license name";

/* No comment provided by engineer. */
"Wrong license, please reset the board" = "Wrong license, please reset the board";

/* No comment provided by engineer. */
"Your email was not sent" = "Your email was not sent";

/* No comment provided by engineer. */
"Your email was not sent." = "Your email was not sent.";

/* No comment provided by engineer. */
"Your message has been sent." = "Your message has been sent.";

/* Generics */
"generic.save" = "Save";
"generic.delete" = "Delete";
"generic.apply" = "Apply";
"generic.enable" = "Enable";
"generic.ssid" = "SSID";
"generic.yes" = "Yes";
"generic.password" = "Password";
"generic.security" = "Security";

/* Battery charged */
"battery.charged" = "charged";

/* Sensor types */
"sensor.accelerometer.title" = "Accelerometer";
"sensor.magnetometer.title" = "Magnetometer";
"sensor._gyroscope.title" = "Gyroscope";
"sensor.termometer.title" = "Temperature";
"sensor.humidity.title" = "Humidity";
"sensor.pressure.title" = "Pressure";
"sensor.microphone.title" = "Microphone";
"sensor.mlc" = "MLC";
"sensor_type_unknown.title" = "Unknown";

/* Sensor data */
"sensor.data.odr" = "ODR";
"sensor.data.fs" = "Full Scale";
"sensor.data.load.ucf" = "Load UCF";
"sensor.data.change.ucf" = "Change UCF";
"sensor.data.no.ucf" = "ucf file not loaded";
"sensor.data.ok.ucf" = "valid ucf file loaded";

/* Loading texts */
"ucf.loading.text" = "UCF file uploading";
"hsdlog.config.loading.text" = "Downloading configuration...";
"hsdlog.config.islogging.text" = "Logging...";

/* Menu voices */
"hsd_save_configuration" = "Save Configuration";
"hsd_load_configuration" = "Load Configuration";
"hsdl_changeAlias" = "Board Alias";

/* Save HSDLog Configuration */
"hsd_saveconf_title" = "Save Configuration Settings";
"hsd_saveconf_save_locally" = "Save locally on the phone";
"hsd_saveconf_asDefault" = "Save permanently on the board";
"hsd_saveconf_all" = "Save both";
"hsd_filename_alert" = "Insert filename";
"hsd_filename_alert_done" = "Done";
"hsd_filename_default" = "STWIN_conf.json";

/* Board alias */
"usd_board_alias" = "Board Alias";
"usd_board_alias_placeholder" = "New board alias";

/* HSD Tag */
"hsd_tag_acquisition_name_placeholder" = "Acquisition name";
"hsd_tag_acquisition_description_placeholder" = "Acquisition description";
"hsd.tag.software.title" = "Software";
"hsd.tag.hardware.title" = "Hardware";
"hsd.tag.startbutton.start" = "Start";
"hsd.tag.startbutton.stop" = "Stop";
"hsd.tag.startbutton.nocard" = "SD Card Missing";
"hsd.tag.edittagname.title" = "Change the the label";
"hsd.firmwareversion.alert.title" = "FW version Alert!";
"hsd.firmwareversion.alert.message" = "Obsolete Firmware detected:\n[%@].\nPlease update it to the latest one:\n[%@].\n\nYou can download it here: %@";
"hsd.tag.select_all.description" = "Select SW/HW tag to enable";
"hsd.tag.select_all" = "Select All";

/* Extended Configuration */
"extconf.main.alert.title" = "In this section it's possible to configure the Firmware running on the board";

/* Ext Commands labels */
"ext.command.section.boardReport.title" = "Board Report";
"ext.command.section.boardSecurity.title" = "Board Security";
"ext.command.section.boardControl.title" = "Board Control";
"ext.command.section.boardSettings.title" = "Board Settings";
"ext.command.section.customCommands.title" = "Custom Commands";

"ext.command.UID.title" = "STM32 UID";
"ext.command.VersionFw.title" = "Version Firmware";
"ext.command.Info.title" = "Info";
"ext.command.Help.title" = "Help";
"ext.command.PowerStatus.title" = "Power Status";
"ext.command.ChangePIN.title" = "Change Security PIN";
"ext.command.ClearDB.title" = "Clear Security Database";
"ext.command.DFU.title" = "Reboot on DFU mode";
"ext.command.Off.title" = "Poweroff";
"ext.command.SetTime.title" = "Set Time";
"ext.command.SetDate.title" = "Set Date";
"ext.command.SetWiFi.title" = "Set Wi-Fi credentials";
"ext.command.SetSensorsConfig.title" = "Sensors Configuration";
"ext.command.SetName.title" = "Set Name";
"ext.command.SetCert.title" = "Certificate Request";
"ext.command.ReadCommand.title" = "Read Commands";
"ext.command.ReadCert.title" = "Certificate Registration";
"ext.command.ReadSensorsConfig.title" = "Sensors Configuration";
"ext.command.ReadCustomCommand.title" = "Read Custom Commands";

"ext.command.ClearDB.executedPhrase" = "Security Database Cleared";
"ext.command.SetTime.executedPhrase" = "Time set";
"ext.command.SetDate.executedPhrase" = "Date set";
"ext.command.DFU.executedPhrase" = "The Board will reboot on DFU Mode";
"ext.command.Off.executedPhrase" = "The Board will be switched off";
"ext.command.changepin.alert.title" = "Change the PIN";
"ext.command.setname.alert.title" = "Set the Board Name";

"ext.command.custom.limits.int" = "%@ <= Valid Value <= %@";
"ext.command.custom.limits.string" = "%@ chars <= Valid Entry <= %@ chars";

"ext.commands.custom.boolean.title" = "False/True";
"ext.command.custom.min.chars.error" = "Field must be less then %@ chars";
"ext.command.custom.max.chars.error" = "Field must be greater then %@ chars";
"ext.command.custom.min.int.error" = "Field must be < %@";
"ext.command.custom.max.int.error" = "Field must be > %@";

/* Update WiFi credentials */
"update.wifi.credentials.title" = "Wi-Fi";
"update.wifi.credentials.done" = "Send to node";

/* Device Certificate */
"device.certificate.register.title" = "Register";
"device.certificate.show.certificate.title" = "Show Certificate";
"device.certificate.hide.certificate.title" = "Hide Certificate";
"device.certificate.title" = "Certificate Management";
"device.certificate.no.certificate.text" = "Certificate not present";
"device.certificate.deviceid.title" = "Device ID";
"device.certificate.received.ok.title" = "Certificated received";
"device.certificate.registered.ok.title" = "Certificated registered";

/* Azure IoT Central */
"iot.title" = "IoT Central Applications";
"iot.nodata.text" = "You don't have any IoT Central.\nTap the + button on top right corner.";
"iot.appDomain.title" = "App Name";
"iot.apiToken.title" = "API Token";
"iot.scopeId.title" = "Scope ID";
"iot.sasKey.title" = "SAS Key";
"iot.save.title" = "Save";
"iot.apps.delete.title" = "Delete";
"iot.scan.qrcode.title" = "Configure with QR Code";
"iot.qrcode.invalid" = "The scanned QRCode is not valid. Please retry with another one.";

/* Devices */
"iot.device.title" = "Devices";
"iot.device.nodata.text" = "You don't have any device\nTap the + button on top right corner.";
"iot.device.form.title" = "Create a new device";
"iot.device.form.create.error.message" = "There was an error during creation. Try again later.";
"iot.device.form.title" = "Create a new device";
"iot.device.form.text" = "To create a new device, select a device model, name and unique ID.";
"iot.device.form.name.title" = "Device Name";
"iot.device.form.id.title" = "Device ID";
"iot.device.form.template.title" = "Device Template";
"iot.device.form.template.not.assigned.title" = "Not assigned";
"iot.device.form.button.title" = "Create";
"iot.device.form.device.template.choice.title" = "Choose device template";
"iot.apps.delete.alert.title" = "Are you sure to delete this device?";

/* Device Detail */
"iot.device.detail.title" = "Device Detail";
"iot.device.detail.show.dashboard.title" = "Show Dashboard";
"iot.device.detail.start.telemetry.title" = "Send Telemetry Data";
"iot.device.delete.title" = "Delete";
"iot.device.delete.alert.title" = "Are you sure to delete this device?";
"iot.device.detail.edit.name.title" = "Update device name";
"iot.device.detail.edit.name.button.title" = "Update";
"iot.device.detail.connection.alert.message" = "There is a problem during connection.";
